In [1]:
# Import Dependencies
import pandas as pd
from sqlalchemy import create_engine

In [2]:
movies_csv = "movies_metadata.csv"

In [3]:
movies_metadata_df = pd.read_csv(movies_csv,low_memory=False)

In [5]:
# read movies file
movies_df = pd.read_csv(movies_csv,low_memory=False)
movies_dataprep = movies_df[[  'id',  'imdb_id', 'revenue']].copy()

#
## typecast to int for merging
#
movies_dataprep.head()

      id    imdb_id      revenue
0    862  tt0114709  373554033.0
1   8844  tt0113497  262797249.0
2  15602  tt0113228          0.0
3  31357  tt0114885   81452156.0
4  11862  tt0113041   76578911.0

In [6]:
Movies_Finance_df=movies_dataprep.rename(columns={"id":"movie_id", "imdb_id ":"imdb_id ",'revenue':'Revenue' })

In [7]:
Movies_Finance_df.head()

   movie_id    imdb_id      Revenue
0       862  tt0114709  373554033.0
1      8844  tt0113497  262797249.0
2     15602  tt0113228          0.0
3     31357  tt0114885   81452156.0
4     11862  tt0113041   76578911.0

In [8]:
Movies_Finance_df.describe()

            movie_id       Revenue
count   45463.000000  4.546000e+04
mean   108359.918813  1.120935e+07
std    112460.749278  6.433225e+07
min         2.000000  0.000000e+00
25%     26449.500000  0.000000e+00
50%     60003.000000  0.000000e+00
75%    157328.000000  0.000000e+00
max    469172.000000  2.787965e+09

In [ ]:
## remove rows with junk movie ids
#Movies_Finance_df = Movies_Finance_df[movies_dataprep.id != '8/20/1997']
#Movies_Finance_df = Movies_Finance_df[movies_dataprep.id != '9/29/2012']
#Movies_Finance_df = Movies_Finance_df[movies_dataprep.id != '1/1/2014']
#Movies_Finance_df = Movies_Finance_df[movies_dataprep.id != '1997-08-20']
#Movies_Finance_df = Movies_Finance_df[movies_dataprep.id != '2012-09-29']
#

In [ ]:
#Movies_Finance_df.id = movies_dataprep.id.astype('int')

In [13]:
Movies_Finance_df=Movies_Finance_df.drop_duplicates()

Movies_Finance_df.describe()

            movie_id       Revenue
count   45413.000000  4.541300e+04
mean   108360.030938  1.121708e+07
std    112468.194250  6.436381e+07
min         2.000000  0.000000e+00
25%     26450.000000  0.000000e+00
50%     59993.000000  0.000000e+00
75%    157343.000000  0.000000e+00
max    469172.000000  2.787965e+09

In [14]:
Movies_Finance_df=Movies_Finance_df.dropna()

In [15]:
Movies_Finance_df.describe()

            movie_id       Revenue
count   45413.000000  4.541300e+04
mean   108360.030938  1.121708e+07
std    112468.194250  6.436381e+07
min         2.000000  0.000000e+00
25%     26450.000000  0.000000e+00
50%     59993.000000  0.000000e+00
75%    157343.000000  0.000000e+00
max    469172.000000  2.787965e+09

In [16]:
rds_connection_string = "root:admin@127.0.0.1/movies_database"
engine = create_engine(f'mysql://{rds_connection_string}')

In [17]:

Movies_Finance_df.to_sql(name='movies_finance', con=engine, if_exists='append', index=False)

In [11]:
(Movies_Finance_df.loc[[1146]])

     movie_id    imdb_id  Revenue
1146    41768  tt0105107      0.0

In [18]:
Movies_Finance_df.describe()

            Revenue
count  4.541200e+04
mean   1.121733e+07
std    6.436449e+07
min    0.000000e+00
25%    0.000000e+00
50%    0.000000e+00
75%    0.000000e+00
max    2.787965e+09

In [ ]:
from sqlalchemy.orm import Session

#movie_genres_df_3585=movie_genres_df_dedup.head(3500)
#movie_genres_df_3585.describe()
#movie_genres_df_dedup.loc[3501:7000]
#
dfSize = Movies_Finance_df.count()



engine.execute("delete from Movies_Finance")

iCounter = -1
batchCount = 1
while iCounter < dfSize[1]:
    print (iCounter+1, iCounter+batchCount)
    subsetToInsert = Movies_Finance_df.loc[iCounter+1: iCounter+batchCount]
    #if iCounter < 10000: 
    subsetToInsert.to_sql(name='Movies_Finance', con=engine, if_exists='append', index=False)
    #else:
    #    engine.dispose()        
    iCounter += batchCount

print (iCounter)

print("reached here")
engine = create_engine(f'mysql://{rds_connection_string}')
subsetToInsert = Movies_Finance_df.loc[12000: 13000]
subsetToInsert.head()
subsetToInsert.to_sql(name='Movies_Finance', con=engine, if_exists='append', index=False)